# Customer Lifetime Value by RFM

In [1]:
# importing essential libraries
import pandas as pd
import numpy as np
import warnings
import xlrd
warnings.filterwarnings('ignore')
import csv

In [3]:
data= pd.read_csv('dataset_from_impala.csv ') 
data

,order_num,orderentry_num,productgroup,created_date,orderentry_revenue,user_id,customer_type,order_status,nettotalprice
0,180522-31324094,0,IM,5/22/2018,1074.000000,001cf,REGISTERED,COMPLETED,976.359985
1,180324-31208188,0,IM,3/24/2018,4871.750000,001gt,GUEST,COMPLETED,4428.859863
2,180324-31214305,0,IM,4/21/2018,4384.250000,001gt,GUEST,COMPLETED,3985.679932
3,180308-31159160,0,IM,3/9/2018,4438.120117,001gt,GUEST,COMPLETED,4034.649902
4,180308-31159160,1,IM,3/9/2018,433.630005,001gt,GUEST,COMPLETED,394.209992
...,...,...,...,...,...,...,...,...,...
31634,180302-31120691,1,IM,3/2/2018,85.879997,zulki,GUEST,COMPLETED,78.070000
31635,180308-31159073,1,IM,3/8/2018,1239.650024,zwizz,GUEST,COMPLETED,1126.949951
31636,180308-31159073,0,IM,3/8/2018,109.349998,zwizz,GUEST,COMPLETED,99.410004
31637,180510-31283695,0,IM,5/10/2018,1349.000000,zzil2,GUEST,COMPLETED,1226.359985
31638,180510-31283695,1,IM,5/10/2018,109.000000,zzil2,GUEST,COMPLETED,99.089996

In [4]:
df2= pd.DataFrame(data)
df2.head(20)

,order_num,orderentry_num,productgroup,created_date,orderentry_revenue,user_id,customer_type,order_status,nettotalprice
0,180522-31324094,0,IM,5/22/2018,1074.000000,001cf,REGISTERED,COMPLETED,976.359985
1,180324-31208188,0,IM,3/24/2018,4871.750000,001gt,GUEST,COMPLETED,4428.859863
2,180324-31214305,0,IM,4/21/2018,4384.250000,001gt,GUEST,COMPLETED,3985.679932
3,180308-31159160,0,IM,3/9/2018,4438.120117,001gt,GUEST,COMPLETED,4034.649902
4,180308-31159160,1,IM,3/9/2018,433.630005,001gt,GUEST,COMPLETED,394.209992
5,180402-31223588,0,IM,4/3/2018,1074.000000,0021c,REGISTERED,COMPLETED,976.359985
6,180227-31100862,1,IM,2/27/2018,110.250000,002ef,REGISTERED,COMPLETED,100.230003
7,180227-31100862,0,IM,2/27/2018,1388.750000,002ef,REGISTERED,COMPLETED,1262.500000
8,180308-31147406,0,IM,3/8/2018,109.349998,3.00E+08,REGISTERED,COMPLETED,99.410004
9,180308-31147406,1,IM,3/8/2018,1239.650024,3.00E+08,REGISTERED,COMPLETED,1126.949951
10,180621-31411287,0,IM,6/27/2018,79.000000,0047d,REGISTERED,COMPLETED,71.820000
11,180308-31147407,0,IM,3/8/2018,107.129997,004df,REGISTERED,COMPLETED,97.389999
12,180308-31147407,1,IM,3/8/2018,966.869995,004df,REGISTERED,COMPLETED,878.969971
13,180516-31300969,0,VD,5/16/2018,1299.000000,527,REGISTERED,COMPLETED,1180.910034
14,180301-31121447,1,IM,3/1/2018,1239.650024,579,REGISTERED,COMPLETED,1126.949951
15,180301-31121447,0,IM,3/1/2018,109.349998,579,REGISTERED,COMPLETED,99.410004
16,180215-31046903,0,IM,2/15/2018,205.699997,0059a,REGISTERED,COMPLETED,187.000000
17,180215-31046903,1,IM,2/15/2018,343.299988,0059a,REGISTERED,COMPLETED,312.089996
18,180303-31142002,0,IM,3/4/2018,108.260002,005ed,REGISTERED,COMPLETED,98.419998
19,180303-31142002,1,IM,3/4/2018,1090.739990,005ed,REGISTERED,COMPLETED,991.580017

In [5]:
dfwee=df2
dfwee

,order_num,orderentry_num,productgroup,created_date,orderentry_revenue,user_id,customer_type,order_status,nettotalprice
0,180522-31324094,0,IM,5/22/2018,1074.000000,001cf,REGISTERED,COMPLETED,976.359985
1,180324-31208188,0,IM,3/24/2018,4871.750000,001gt,GUEST,COMPLETED,4428.859863
2,180324-31214305,0,IM,4/21/2018,4384.250000,001gt,GUEST,COMPLETED,3985.679932
3,180308-31159160,0,IM,3/9/2018,4438.120117,001gt,GUEST,COMPLETED,4034.649902
4,180308-31159160,1,IM,3/9/2018,433.630005,001gt,GUEST,COMPLETED,394.209992
...,...,...,...,...,...,...,...,...,...
31634,180302-31120691,1,IM,3/2/2018,85.879997,zulki,GUEST,COMPLETED,78.070000
31635,180308-31159073,1,IM,3/8/2018,1239.650024,zwizz,GUEST,COMPLETED,1126.949951
31636,180308-31159073,0,IM,3/8/2018,109.349998,zwizz,GUEST,COMPLETED,99.410004
31637,180510-31283695,0,IM,5/10/2018,1349.000000,zzil2,GUEST,COMPLETED,1226.359985
31638,180510-31283695,1,IM,5/10/2018,109.000000,zzil2,GUEST,COMPLETED,99.089996

In [40]:
#df2=df

# RFM Analysis

RFM (Recency, Frequency, Monetary) analysis is a customer segmentation technique that uses past purchase behavior to divide customers into groups. RFM helps divide customers into various categories or clusters to identify customers who are more likely to respond to promotions and also for future personalization services.
RECENCY (R): Days since last purchase. you have to subtract last purchase date from today's date. 
FREQUENCY (F): Total number of purchases
MONETARY VALUE (M): Total money this customer spent.
We will create those 3 customer attributes for each customer.

In [7]:
# finding maximum created date from each customer group
recency_df1 = df2.groupby(by='user_id', as_index=False)['created_date'].max()
recency_df1=recency_df1.rename(columns={'created_date':'max_created_date'})
recency_df1

        user_id max_created_date
0      0.00E+00        5/19/2018
1         001cf        5/22/2018
2         001gt        4/21/2018
3         0021c         4/3/2018
4         002ef        2/27/2018
...         ...              ...
13297     ztale        5/10/2018
13298     zulfa        4/18/2018
13299     zulki         3/2/2018
13300     zwizz         3/8/2018
13301     zzil2        5/10/2018

[13302 rows x 2 columns]

In [8]:
## finding minimum created date from each customer group
recency_df2 = df2.groupby(by='user_id', as_index=False)['created_date'].min()
recency_df2=recency_df2.rename(columns={'created_date':'min_created_date'})
recency_df2

        user_id min_created_date
0      0.00E+00         1/2/2018
1         001cf        5/22/2018
2         001gt        3/24/2018
3         0021c         4/3/2018
4         002ef        2/27/2018
...         ...              ...
13297     ztale        5/10/2018
13298     zulfa        4/18/2018
13299     zulki         3/2/2018
13300     zwizz         3/8/2018
13301     zzil2        5/10/2018

[13302 rows x 2 columns]

In [9]:
# combining the above 2 dataframes
recency_df3_first=recency_df1.merge(recency_df2, left_on='user_id', right_on='user_id', how='outer')
recency_df3_first

        user_id max_created_date min_created_date
0      0.00E+00        5/19/2018         1/2/2018
1         001cf        5/22/2018        5/22/2018
2         001gt        4/21/2018        3/24/2018
3         0021c         4/3/2018         4/3/2018
4         002ef        2/27/2018        2/27/2018
...         ...              ...              ...
13297     ztale        5/10/2018        5/10/2018
13298     zulfa        4/18/2018        4/18/2018
13299     zulki         3/2/2018         3/2/2018
13300     zwizz         3/8/2018         3/8/2018
13301     zzil2        5/10/2018        5/10/2018

[13302 rows x 3 columns]

In [10]:
##df_new=df2[['user_id','productgroup']]
#df_new

In [11]:
#df_new1=df_new.drop_duplicates(subset=None, keep='first', inplace=False)
#df_new1

In [12]:
#recency_df3=recency_df3_first.merge(df_new1, left_on='user_id', right_on='user_id', how='outer')
#recency_df3

In [13]:
# this step is essential to change min_created_date and max_created_date to date format since the former 2 are strings, 
#couldn't useful to calculate difference between 2 dates
import pandas as pd
recency_df3_first['new_max_date'] = pd.DatetimeIndex(recency_df3_first['max_created_date']).date
recency_df3_first['new_min_date'] = pd.DatetimeIndex(recency_df3_first['min_created_date']).date
recency_df3_first

        user_id max_created_date min_created_date new_max_date new_min_date
0      0.00E+00        5/19/2018         1/2/2018   2018-05-19   2018-01-02
1         001cf        5/22/2018        5/22/2018   2018-05-22   2018-05-22
2         001gt        4/21/2018        3/24/2018   2018-04-21   2018-03-24
3         0021c         4/3/2018         4/3/2018   2018-04-03   2018-04-03
4         002ef        2/27/2018        2/27/2018   2018-02-27   2018-02-27
...         ...              ...              ...          ...          ...
13297     ztale        5/10/2018        5/10/2018   2018-05-10   2018-05-10
13298     zulfa        4/18/2018        4/18/2018   2018-04-18   2018-04-18
13299     zulki         3/2/2018         3/2/2018   2018-03-02   2018-03-02
13300     zwizz         3/8/2018         3/8/2018   2018-03-08   2018-03-08
13301     zzil2        5/10/2018        5/10/2018   2018-05-10   2018-05-10

[13302 rows x 5 columns]

In [14]:
print(recency_df3_first.dtypes)

user_id             object
max_created_date    object
min_created_date    object
new_max_date        object
new_min_date        object
dtype: object

In [15]:
from datetime import date
dt=date.today()
print(dt)
recency_df3_first['Recency'] = recency_df3_first['new_max_date'].apply(lambda x: (dt - x).days)
recency_df3_first.head()

2024-12-19

,user_id,max_created_date,min_created_date,new_max_date,new_min_date,Recency
0,0.00E+00,5/19/2018,1/2/2018,2018-05-19,2018-01-02,2406
1,001cf,5/22/2018,5/22/2018,2018-05-22,2018-05-22,2403
2,001gt,4/21/2018,3/24/2018,2018-04-21,2018-03-24,2434
3,0021c,4/3/2018,4/3/2018,2018-04-03,2018-04-03,2452
4,002ef,2/27/2018,2/27/2018,2018-02-27,2018-02-27,2487

In [16]:
recency_df4=recency_df3_first
recency_df4

,user_id,max_created_date,min_created_date,new_max_date,new_min_date,Recency
0,0.00E+00,5/19/2018,1/2/2018,2018-05-19,2018-01-02,2406
1,001cf,5/22/2018,5/22/2018,2018-05-22,2018-05-22,2403
2,001gt,4/21/2018,3/24/2018,2018-04-21,2018-03-24,2434
3,0021c,4/3/2018,4/3/2018,2018-04-03,2018-04-03,2452
4,002ef,2/27/2018,2/27/2018,2018-02-27,2018-02-27,2487
...,...,...,...,...,...,...
13297,ztale,5/10/2018,5/10/2018,2018-05-10,2018-05-10,2415
13298,zulfa,4/18/2018,4/18/2018,2018-04-18,2018-04-18,2437
13299,zulki,3/2/2018,3/2/2018,2018-03-02,2018-03-02,2484
13300,zwizz,3/8/2018,3/8/2018,2018-03-08,2018-03-08,2478
13301,zzil2,5/10/2018,5/10/2018,2018-05-10,2018-05-10,2415

In [17]:
import numpy as np
rfmTable1 = dfwee.groupby(['user_id']).agg({'order_num': lambda x: x.nunique(),# Frequency 
                                        'nettotalprice': lambda x: x.sum()}) # Monetary Value

In [18]:
rfmTable1

          order_num  nettotalprice
user_id
0.00E+00          3    3424.549969
001cf             1     976.359985
001gt             3   12843.399689
0021c             1     976.359985
002ef             1    1362.730003
...             ...            ...
ztale             1     472.000000
zulfa             1     599.500000
zulki             1     797.129997
zwizz             1    1226.359955
zzil2             1    1325.449981

[13302 rows x 2 columns]

In [19]:
rfmTable1=rfmTable1.rename(columns={'order_num':'Frequency', 'nettotalprice':'Monetary' })
rfmTable1

          Frequency      Monetary
user_id
0.00E+00          3   3424.549969
001cf             1    976.359985
001gt             3  12843.399689
0021c             1    976.359985
002ef             1   1362.730003
...             ...           ...
ztale             1    472.000000
zulfa             1    599.500000
zulki             1    797.129997
zwizz             1   1226.359955
zzil2             1   1325.449981

[13302 rows x 2 columns]

In [20]:
result = pd.merge(recency_df4, rfmTable1, how='outer', on=['user_id'])
result

,user_id,max_created_date,min_created_date,new_max_date,new_min_date,Recency,Frequency,Monetary
0,0.00E+00,5/19/2018,1/2/2018,2018-05-19,2018-01-02,2406,3,3424.549969
1,001cf,5/22/2018,5/22/2018,2018-05-22,2018-05-22,2403,1,976.359985
2,001gt,4/21/2018,3/24/2018,2018-04-21,2018-03-24,2434,3,12843.399689
3,0021c,4/3/2018,4/3/2018,2018-04-03,2018-04-03,2452,1,976.359985
4,002ef,2/27/2018,2/27/2018,2018-02-27,2018-02-27,2487,1,1362.730003
...,...,...,...,...,...,...,...,...
13297,ztale,5/10/2018,5/10/2018,2018-05-10,2018-05-10,2415,1,472.000000
13298,zulfa,4/18/2018,4/18/2018,2018-04-18,2018-04-18,2437,1,599.500000
13299,zulki,3/2/2018,3/2/2018,2018-03-02,2018-03-02,2484,1,797.129997
13300,zwizz,3/8/2018,3/8/2018,2018-03-08,2018-03-08,2478,1,1226.359955
13301,zzil2,5/10/2018,5/10/2018,2018-05-10,2018-05-10,2415,1,1325.449981

In [21]:
result=result.rename(columns={'order_num':'Frequency', 'nettotalprice':'Monetary' })
result

,user_id,max_created_date,min_created_date,new_max_date,new_min_date,Recency,Frequency,Monetary
0,0.00E+00,5/19/2018,1/2/2018,2018-05-19,2018-01-02,2406,3,3424.549969
1,001cf,5/22/2018,5/22/2018,2018-05-22,2018-05-22,2403,1,976.359985
2,001gt,4/21/2018,3/24/2018,2018-04-21,2018-03-24,2434,3,12843.399689
3,0021c,4/3/2018,4/3/2018,2018-04-03,2018-04-03,2452,1,976.359985
4,002ef,2/27/2018,2/27/2018,2018-02-27,2018-02-27,2487,1,1362.730003
...,...,...,...,...,...,...,...,...
13297,ztale,5/10/2018,5/10/2018,2018-05-10,2018-05-10,2415,1,472.000000
13298,zulfa,4/18/2018,4/18/2018,2018-04-18,2018-04-18,2437,1,599.500000
13299,zulki,3/2/2018,3/2/2018,2018-03-02,2018-03-02,2484,1,797.129997
13300,zwizz,3/8/2018,3/8/2018,2018-03-08,2018-03-08,2478,1,1226.359955
13301,zzil2,5/10/2018,5/10/2018,2018-05-10,2018-05-10,2415,1,1325.449981

In [22]:
result.dtypes

user_id              object
max_created_date     object
min_created_date     object
new_max_date         object
new_min_date         object
Recency               int64
Frequency             int64
Monetary            float64
dtype: object

In [23]:
rfmTable_additional= result[['user_id','new_max_date','new_min_date']]
rfmTable_additional.drop_duplicates(subset=None, keep='first', inplace=False)

        user_id new_max_date new_min_date
0      0.00E+00   2018-05-19   2018-01-02
1         001cf   2018-05-22   2018-05-22
2         001gt   2018-04-21   2018-03-24
3         0021c   2018-04-03   2018-04-03
4         002ef   2018-02-27   2018-02-27
...         ...          ...          ...
13297     ztale   2018-05-10   2018-05-10
13298     zulfa   2018-04-18   2018-04-18
13299     zulki   2018-03-02   2018-03-02
13300     zwizz   2018-03-08   2018-03-08
13301     zzil2   2018-05-10   2018-05-10

[13302 rows x 3 columns]

In [24]:
rfmTable = result[['user_id','Recency', 'Frequency','Monetary']]
#rfmTable
rfmTable.sort_values('Recency', ascending=True)

     user_id  Recency  Frequency     Monetary
8267   edisk     2364          1   981.090027
285    0d467     2364          1  2290.090088
8805   fai.t     2364          7  6016.880091
4619   9d67f     2364          1  1445.729988
2621   5adbb     2364          1   362.730011
...      ...      ...        ...          ...
3530   7941f     2544          1   252.680000
6280   brown     2544          1  1271.819946
2489   55bfb     2544          1    40.500000
2414   5341c     2544          1    72.600000
4123   8cba0     2544          1  1469.999989

[13302 rows x 4 columns]

In [25]:

rfmTable.dtypes

user_id       object
Recency        int64
Frequency      int64
Monetary     float64
dtype: object

# Customer segments with RFM Model

The simplest way to create customers segments from RFM Model is to use Quartiles. 
We assign a score from 1 to 4 to Recency, Frequency and Monetary. 
1 is the best/highest value, and 4 is the lowest/worst value.
A final RFM score is calculated simply by combining individual RFMClass numbers.
Note: Quantiles (score from 1-5) offer better granularity, in case the business needs that but it will be more challenging to create segments since we will have 555 possible combinations. So, we will use quartiles.



In statistics and the theory of probability, quantiles are cutpoints dividing the range of a probability distribution into contiguous intervals with equal probabilities, 
or dividing the observations in a sample in the same way. There are one fewer quantiles than the number of groups created. 
Thus quartiles are the three cut points that will divide a dataset into four equal-size groups.

In [26]:
#RFM Quartiles
quantiles = rfmTable.quantile(q=[0.25,0.5,0.75])
quantiles

      Recency  Frequency     Monetary
0.25   2414.0        1.0   244.550003
0.50   2471.0        1.0  1090.000000
0.75   2483.0        1.0  1298.179985

In [27]:
quantiles.to_dict()

{'Recency': {0.25: 2414.0, 0.5: 2471.0, 0.75: 2483.0},
 'Frequency': {0.25: 1.0, 0.5: 1.0, 0.75: 1.0},
 'Monetary': {0.25: 244.5500031, 0.5: 1090.0, 0.75: 1298.17998469}}

# Definitions for customer segments:
1. Best Customers - Bought most recently and most often, and spend the most
2. Loyal Customers - Buy most frequently
3. Big Spenders - Spend the most
4. Recent Customers - Bought more recently
5. Almost Lost - Haven’t purchased for somewhat some time, but purchased some what frequently and spend the somewhat the most
6. Lost Customers - Haven’t purchased for some time, but purchased frequently and spend the most
7. Lost but low revenue generated Customers - Last purchased long ago, purchased few, and spent little
8. Others - The people who are not having the above scores will come to others category. This has to be filtered in Tableau

In [28]:
#extra
# Arguments (x = value, p = recency, monetary_value, frequency, k = quartiles dict)
def RClass(x,p,d):
    if x <= d[p][0.25]:
        return 1
    elif x <= d[p][0.50]:
        return 2
    elif x <= d[p][0.75]: 
        return 3
    else:
        return 4
    
# Arguments (x = value, p = recency, monetary_value, frequency, k = quartiles dict)
def FMClass(x,p,d):
    if x <= d[p][0.25]:
        return 4
    elif x <= d[p][0.50]:
        return 3
    elif x <= d[p][0.75]: 
        return 2
    else:
        return 1

In [29]:
rfmSegmentation1=rfmTable
rfmSegmentation1['R_Quartile'] = rfmSegmentation1['Recency'].apply(RClass, args=('Recency',quantiles,))
rfmSegmentation1['F_Quartile'] = rfmSegmentation1['Frequency'].apply(FMClass, args=('Frequency',quantiles,))
rfmSegmentation1['M_Quartile'] = rfmSegmentation1['Monetary'].apply(FMClass, args=('Monetary',quantiles,))

In [30]:
rfmSegmentation1['RFMClass'] = rfmSegmentation1.R_Quartile.map(str) \
                            + rfmSegmentation1.F_Quartile.map(str) \
                            + rfmSegmentation1.M_Quartile.map(str)

In [31]:
rfmSegmentation1

,user_id,Recency,Frequency,Monetary,R_Quartile,F_Quartile,M_Quartile,RFMClass
0,0.00E+00,2406,3,3424.549969,1,1,1,111
1,001cf,2403,1,976.359985,1,4,3,143
2,001gt,2434,3,12843.399689,2,1,1,211
3,0021c,2452,1,976.359985,2,4,3,243
4,002ef,2487,1,1362.730003,4,4,1,441
...,...,...,...,...,...,...,...,...
13297,ztale,2415,1,472.000000,2,4,3,243
13298,zulfa,2437,1,599.500000,2,4,3,243
13299,zulki,2484,1,797.129997,4,4,3,443
13300,zwizz,2478,1,1226.359955,3,4,2,342
13301,zzil2,2415,1,1325.449981,2,4,1,241

In [32]:
result_newt111 = pd.merge(rfmSegmentation1, result, how='outer', on=['user_id','Monetary'])
result_newt3=result_newt111.drop_duplicates()

In [33]:
result_newt3.drop_duplicates()

,user_id,Recency_x,Frequency_x,Monetary,R_Quartile,F_Quartile,M_Quartile,RFMClass,max_created_date,min_created_date,new_max_date,new_min_date,Recency_y,Frequency_y
0,0.00E+00,2406,3,3424.549969,1,1,1,111,5/19/2018,1/2/2018,2018-05-19,2018-01-02,2406,3
1,001cf,2403,1,976.359985,1,4,3,143,5/22/2018,5/22/2018,2018-05-22,2018-05-22,2403,1
2,001gt,2434,3,12843.399689,2,1,1,211,4/21/2018,3/24/2018,2018-04-21,2018-03-24,2434,3
3,0021c,2452,1,976.359985,2,4,3,243,4/3/2018,4/3/2018,2018-04-03,2018-04-03,2452,1
4,002ef,2487,1,1362.730003,4,4,1,441,2/27/2018,2/27/2018,2018-02-27,2018-02-27,2487,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13297,ztale,2415,1,472.000000,2,4,3,243,5/10/2018,5/10/2018,2018-05-10,2018-05-10,2415,1
13298,zulfa,2437,1,599.500000,2,4,3,243,4/18/2018,4/18/2018,2018-04-18,2018-04-18,2437,1
13299,zulki,2484,1,797.129997,4,4,3,443,3/2/2018,3/2/2018,2018-03-02,2018-03-02,2484,1
13300,zwizz,2478,1,1226.359955,3,4,2,342,3/8/2018,3/8/2018,2018-03-08,2018-03-08,2478,1
13301,zzil2,2415,1,1325.449981,2,4,1,241,5/10/2018,5/10/2018,2018-05-10,2018-05-10,2415,1

In [34]:
del result_newt3['Recency_y']
del result_newt3['Frequency_y']

In [35]:
result_newt3

,user_id,Recency_x,Frequency_x,Monetary,R_Quartile,F_Quartile,M_Quartile,RFMClass,max_created_date,min_created_date,new_max_date,new_min_date
0,0.00E+00,2406,3,3424.549969,1,1,1,111,5/19/2018,1/2/2018,2018-05-19,2018-01-02
1,001cf,2403,1,976.359985,1,4,3,143,5/22/2018,5/22/2018,2018-05-22,2018-05-22
2,001gt,2434,3,12843.399689,2,1,1,211,4/21/2018,3/24/2018,2018-04-21,2018-03-24
3,0021c,2452,1,976.359985,2,4,3,243,4/3/2018,4/3/2018,2018-04-03,2018-04-03
4,002ef,2487,1,1362.730003,4,4,1,441,2/27/2018,2/27/2018,2018-02-27,2018-02-27
...,...,...,...,...,...,...,...,...,...,...,...,...
13297,ztale,2415,1,472.000000,2,4,3,243,5/10/2018,5/10/2018,2018-05-10,2018-05-10
13298,zulfa,2437,1,599.500000,2,4,3,243,4/18/2018,4/18/2018,2018-04-18,2018-04-18
13299,zulki,2484,1,797.129997,4,4,3,443,3/2/2018,3/2/2018,2018-03-02,2018-03-02
13300,zwizz,2478,1,1226.359955,3,4,2,342,3/8/2018,3/8/2018,2018-03-08,2018-03-08
13301,zzil2,2415,1,1325.449981,2,4,1,241,5/10/2018,5/10/2018,2018-05-10,2018-05-10

In [36]:
result_newt3.to_csv('clv_result_training.csv')

In [37]:
# This part is only for our validation. But in tableau we've to use the code displayed after this cell
"""How many customers do we have in each segment?"""
print("Best Customers: ",len(result_newt3[result_newt3['RFMClass']=='111']))
print('Loyal Customers: ',len(result_newt3[result_newt3['F_Quartile']==1]))
print("Big Spenders: ",len(result_newt3[result_newt3['M_Quartile']==1]))
print("One Time Customers: ",len(result_newt3[result_newt3['R_Quartile']==1]))
print('Almost Lost: ', len(result_newt3[result_newt3['RFMClass']=='311']))
print('Lost but high revenue generated Customers: ',len(result_newt3[result_newt3['RFMClass']=='411']))
print('Lost but low revenue generated Customers: ',len(result_newt3[result_newt3['RFMClass']=='434']))

Best Customers:  833
Loyal Customers:  2150
Big Spenders:  3312
One Time Customers:  3342
Almost Lost:  286
Lost but high revenue generated Customers:  79
Lost but low revenue generated Customers:  0

In [38]:
"""
https://community.tableau.com/thread/229984
use the following code in tableau
IF REGEXP_MATCH(STR([RFMClass]),'111') THEN "Best Customers"

ELSEIF [RFMClass]=311 THEN "Almost Lost"

ELSEIF [RFMClass]=411 THEN "Lost but high revenue generated Customers"

ELSEIF [RFMClass]=444 OR REGEXP_MATCH(STR([RFMClass]),'4[3-4][3-4]')  THEN "Lost but low revenue generated Customers"

ELSEIF REGEXP_MATCH(STR([RFMClass]),'1[1-4][1-4]') THEN "Recent Customers"

ELSEIF REGEXP_MATCH(STR([RFMClass]),'[1-4]1[1-4]') THEN "Loyal Customers"

ELSEIF REGEXP_MATCH(STR([RFMClass]),'[1-4][1-4]1') THEN "Big Spenders"

ELSE "Others"

END
"""

'\nhttps://community.tableau.com/thread/229984\nuse the following code in tableau\nIF REGEXP_MATCH(STR([RFMClass]),\'111\') THEN "Best Customers"\n\nELSEIF [RFMClass]=311 THEN "Almost Lost"\n\nELSEIF [RFMClass]=411 THEN "Lost but high revenue generated Customers"\n\nELSEIF [RFMClass]=444 OR REGEXP_MATCH(STR([RFMClass]),\'4[3-4][3-4]\')  THEN "Lost but low revenue generated Customers"\n\nELSEIF REGEXP_MATCH(STR([RFMClass]),\'1[1-4][1-4]\') THEN "Recent Customers"\n\nELSEIF REGEXP_MATCH(STR([RFMClass]),\'[1-4]1[1-4]\') THEN "Loyal Customers"\n\nELSEIF REGEXP_MATCH(STR([RFMClass]),\'[1-4][1-4]1\') THEN "Big Spenders"\n\nELSE "Others"\n\nEND\n'

In [39]:
# https://www.putler.com/docs/rfm-segmentation/

"""IF REGEXP_MATCH(STR([RFM Class.]),'111') THEN "Best Customers"
ELSEIF [RFM Class.] = 411 THEN "Can't Lose Them"
ELSEIF [RFM Class.] = 444 THEN "Lost Customers"
ELSEIF REGEXP_MATCH(STR([RFM Class.]),'24[1-2]') THEN "Customers Needing Attention"
ELSEIF REGEXP_MATCH(STR([RFM Class.]),'[1-2][1-2][1-2]') THEN "Loyal Customers"
ELSEIF REGEXP_MATCH(STR([RFM Class.]),'1[1-4]1') THEN "Potential Loyalist"
ELSEIF REGEXP_MATCH(STR([RFM Class.]),'[1-2][3-4][1-4]') THEN "Recent Customers"
ELSEIF REGEXP_MATCH(STR([RFM Class.]),'[1-2][1-2][3-4]') THEN "Promising Customers"
ELSEIF REGEXP_MATCH(STR([RFM Class.]),'[3-4][3-4][3-4]') THEN "About to Quit"
ELSEIF REGEXP_MATCH(STR([RFM Class.]),'[3-4][1-2][1-2]') THEN "At Risk"
ELSEIF REGEXP_MATCH(STR([RFM Class.]),'[1-4][1-4][1-2]') THEN "Big Spenders"
ELSEIF REGEXP_MATCH(STR([RFM Class.]),'[3-4][1][3-4]') THEN "Hibernating"
ELSE "Others"
END
"""

'IF REGEXP_MATCH(STR([RFM Class.]),\'111\') THEN "Best Customers"\nELSEIF [RFM Class.] = 411 THEN "Can\'t Lose Them"\nELSEIF [RFM Class.] = 444 THEN "Lost Customers"\nELSEIF REGEXP_MATCH(STR([RFM Class.]),\'24[1-2]\') THEN "Customers Needing Attention"\nELSEIF REGEXP_MATCH(STR([RFM Class.]),\'[1-2][1-2][1-2]\') THEN "Loyal Customers"\nELSEIF REGEXP_MATCH(STR([RFM Class.]),\'1[1-4]1\') THEN "Potential Loyalist"\nELSEIF REGEXP_MATCH(STR([RFM Class.]),\'[1-2][3-4][1-4]\') THEN "Recent Customers"\nELSEIF REGEXP_MATCH(STR([RFM Class.]),\'[1-2][1-2][3-4]\') THEN "Promising Customers"\nELSEIF REGEXP_MATCH(STR([RFM Class.]),\'[3-4][3-4][3-4]\') THEN "About to Quit"\nELSEIF REGEXP_MATCH(STR([RFM Class.]),\'[3-4][1-2][1-2]\') THEN "At Risk"\nELSEIF REGEXP_MATCH(STR([RFM Class.]),\'[1-4][1-4][1-2]\') THEN "Big Spenders"\nELSEIF REGEXP_MATCH(STR([RFM Class.]),\'[3-4][1][3-4]\') THEN "Hibernating"\nELSE "Others"\nEND\n'